{
    "start": {
      "description": "Ты отправляешься в деревню к старой бабушке. Ее дом выглядит как страшный замок, окруженный темным лесом. Перед тобой развилка: пойти через темный лес или идти вокруг, по замкнутой дорожке.",
      "image": "image/start.jpg",
      "actions": {
        "Пойти через лес": "figure",
        "Пойти вокруг по дороге": "path_selection"
      }
    },
    "figure": {
      "description": "Ты решаешь пройти через темный лес. Среди деревьев ты слышишь странные шорохи. Внезапно перед тобой возникает таинственная фигура. Ты можешь либо попробовать сбежать, либо поговорить с ней.",
      "image": "image/figure.jpg",
      "actions": {
        "Сбежать": "loose",
        "Поговорить": "witch_and_castle"

      }
    },
    "witch_and_castle": {
      "description": "Если ты выбрал поговорить с таинственной фигурой в темном лесу, оказывается, что это была старая ведьма. Она предлагает тебе зайти в ее замок, утверждая, что у нее есть магическое зелье, способное исполнить одно твое желание.",
      "image": "image/witch_castle.jpg",
      "actions": {
        "Зайти": "castle_table",
        "Идти дальше": "lawn"

      }
    },
    "castle_table": {
      "description": "Если ты принял предложение ведьмы, она ведет тебя внутрь замка и указывает на стол, где стоит зелье. Но ты замечаешь, что ведьма улыбается нечисто, и у тебя появляется подозрение. Ты можешь либо выпить зелье, либо попробовать схватить его и убежать.",
      "image": "image/witch_table.jpg",
      "actions": {
        "Выпить зелье": "win",
        "Попытаться убежать": "loose"
      }
    },
    "lawn": {
      "description": "Так ты дошел до необычной поляны, здесь какие-то странные цветы, небо темного цвета...Бух! Вдруг ты провалился в портал..*.*.*.*.*.*.*.*.*.*....Портал вернул тебя в самое начало истории",
      "image": "image/lawn.jpg",
      "actions": {
        "Начать заново": "start"
      }
    },
    "path_selection": {
      "description": "Ты выбираешь путь вокруг, по замкнутой дорожке. По пути ты видишь необычные следы. Придется выбрать, идти ли дальше по дорожке или свернуть в лес.",
      "image": "image/path_change.jpg",
      "actions": {
        "Продолжать по дорожке": "lawn",
        "Свернуть в лес": "The forester's house"
      }
    },
    "The forester's house": {
      "description": "Если ты свернул в лес по замкнутой дорожке, то ты находишь таинственную поляну, где растут странные цветы. По центру поляны стоит дом лестника. Ты можешь либо открыть дверь, либо вернуться на дорожку.",
      "image": "image/forest_house.jpg",
      "actions": {
        "На дорожку": "lawn",
        "Открыть дверь": "Behind the door"
      }
    },
    "Behind the door": {
      "description": "Если ты открыл дверь на таинственной поляне, то оказываешься в загадочном мире лесничих, где все кажется настоящим, но не таким, каким должно быть. Тебе предстоит принять решение: идти глубже в этот мир или попытаться вернуться.",
      "image": "image/behind_the_door.jpg",
      "actions": {
        "Мне нужно внутрь": "win",
        "Нужно вернуться, пока еще не поздно": "loose"
      }
    },
    "loose": {
      "description": "Такой ты не решительный, а вдруг там было что-то интересное. Кто не рискует, тот не пьет шампанское",
      "image": "image/loose.jpg",
      "actions": {
        "Начать заново": "start"
      }
    },
    "win": {
        "description": "Привет, внучок, твоя бабуля хозяйка этого леса и его окрестностей. Мы с тобой не так близко знакомы. Но благодаря моим ребятам, я познакомилась с тобой поближе. Ты смелый парень, у нас в цене такие! ",
        "image": "image/grandma_approves.png",
        "actions": {
          "Начать заново": "start"
      }
    }
}